#+TITLE:     Dynamische Speicherverwaltung
#+AUTHOR:    Thomas Hausberger, Matthias Panny, Sebastian Stabinger
#+DATE:      SS2022

** Memory Leak --- Beispiel
#+begin_src C
  #include <stdio.h>
  #include <stdlib.h>

  typedef struct Complex {
    double real, imag;
  } Complex;

  Complex *randcomplex() {
    Complex *res = malloc(sizeof(Complex));
    res->imag = rand() % 1000;
    res->real = rand() % 200;
    return res;
  }

  int main() {
    double realsum = 0;
    double imagsum = 0;
    for (int i = 0; i < 100; i++) {
      Complex *c = randcomplex();
      realsum += c->real;
      imagsum += c->imag;
      // Wir müssten hier eigentlich free(c) aufrufen!
    }
    // Wir haben in der for-Schleife 800 Byte Speicher verloren
    printf("Durchschnitt real=%f, imag=%f\n", realsum / 100, imagsum / 100);
  }
#+end_src

#+RESULTS:
| Durchschnitt real=104.800000 | imag=481.820000 |

